In [1]:
import pandas as pd
import numpy as np

In [10]:
amount = np.random.randint(3,30, (5,4))
zoo = ['A', 'B', 'C', 'D', 'E']

In [11]:
df = pd.DataFrame(amount, index = zoo, columns = ['Tiger', 'Lions', 'Deer', 'Elephant'])
df

   Tiger  Lions  Deer  Elephant
A     24     17    11         6
B     10     29    24         7
C      5     16    15        12
D     26      5     7        11
E     29     25    18        15

In [13]:
df.loc['C', 'Elephant']

12

In [14]:
df.loc['A']

Tiger       24
Lions       17
Deer        11
Elephant     6
Name: A, dtype: int32

In [17]:
df.iloc[0,0]

24

In [18]:
df.iloc[0:2, 0:2]

   Tiger  Lions
A     24     17
B     10     29

In [19]:
df.loc['A':'C', 'Lions': 'Elephant']

   Lions  Deer  Elephant
A     17    11         6
B     29    24         7
C     16    15        12

In [20]:
df.iloc[:2, 1:]

   Lions  Deer  Elephant
A     17    11         6
B     29    24         7

In [23]:
df['Lions'][:2]

A    17
B    29
Name: Lions, dtype: int32

In [25]:
a = 10
a > 3

True

In [27]:
df > 10

   Tiger  Lions   Deer  Elephant
A   True   True   True     False
B  False   True   True     False
C  False   True   True      True
D   True  False  False      True
E   True   True   True      True

In [28]:
df.Lions > 10

A     True
B     True
C     True
D    False
E     True
Name: Lions, dtype: bool

In [29]:
df['Lions'] > 10

A     True
B     True
C     True
D    False
E     True
Name: Lions, dtype: bool

In [32]:
df[df['Lions'] > 10]

   Tiger  Lions  Deer  Elephant
A     24     17    11         6
B     10     29    24         7
C      5     16    15        12
E     29     25    18        15

In [33]:
df[(df['Lions'] > 7) & (df.Deer > 10)]

   Tiger  Lions  Deer  Elephant
A     24     17    11         6
B     10     29    24         7
C      5     16    15        12
E     29     25    18        15

In [34]:
df[(df['Lions'] > 7) | (df.Deer > 10)]

   Tiger  Lions  Deer  Elephant
A     24     17    11         6
B     10     29    24         7
C      5     16    15        12
E     29     25    18        15

In [35]:
df.iloc[0] > 10

Tiger        True
Lions        True
Deer         True
Elephant    False
Name: A, dtype: bool

In [42]:
data = {'Sequence':['First', 'Second', 'Third', 'Forth'], 'Numbers': [1, 2, 3, 4]}
print(data)

{'Sequence': ['First', 'Second', 'Third', 'Forth'], 'Numbers': [1, 2, 3, 4]}

In [43]:
df2 = pd.DataFrame(data)
df2

  Sequence  Numbers
0    First        1
1   Second        2
2    Third        3
3    Forth        4

In [52]:
a = df2['Numbers']
print(a)

0    1
1    2
2    3
3    4
Name: Numbers, dtype: int64

In [55]:
b = df2[['Numbers', 'Sequence']]
print(b)

   Numbers Sequence
0        1    First
1        2   Second
2        3    Third
3        4    Forth

In [56]:
c = df2.loc[:2,'Numbers']
print(c)

0    1
1    2
2    3
Name: Numbers, dtype: int64

In [58]:
d = df2.loc[2:,['Numbers','Sequence']]
print(d)

   Numbers Sequence
2        3    Third
3        4    Forth

In [59]:
f = df2.iloc[:2,:]
print(f)

  Sequence  Numbers
0    First        1
1   Second        2

In [60]:
g = df2.iloc[:, 1:2]
print(g)

   Numbers
0        1
1        2
2        3
3        4